//=============================================================================
//
// 赤林檎処理 [apple_red.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _APPLE_RED_H_
#define _APPLE_RED_H_

#include "glowApple.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// 赤林檎クラス
//*****************************************************************************
class CAppleRed : public CGlowApple
{
public:
	CAppleRed();		//デフォルトコンストラクタ
	CAppleRed(CAppleTree* pTree);		//オーバーロードされたコンストラクタ
	virtual ~CAppleRed();		//デストラクタ
	static CAppleRed* Create(D3DXVECTOR3 pos, CAppleTree* pTree);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:

};

#endif // !_APPLE_RED_H_