//=============================================================================
//
// 銀林檎処理 [apple_silver.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _APPLE_SILVER_H_
#define _APPLE_SILVER_H_

#include "glowApple.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CEffect;

//*****************************************************************************
// 銀林檎クラス
//*****************************************************************************
class CAppleSilver : public CGlowApple
{
public:
	CAppleSilver();		//デフォルトコンストラクタ
	CAppleSilver(CAppleTree* pTree);		//オーバーロードされたコンストラクタ
	virtual ~CAppleSilver();		//デストラクタ
	static CAppleSilver* Create(D3DXVECTOR3 pos, CAppleTree* pTree);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:
	CEffect* m_pEffectThunder;	//雷のエフェクト

};

#endif // !_APPLE_SILVER_H_