//=============================================================================
//
// 白林檎処理 [apple_white.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _APPLE_WHITE_H_
#define _APPLE_WHITE_H_

#include "glowApple.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CEffect;

//*****************************************************************************
// 白林檎クラス
//*****************************************************************************
class CAppleWhite : public CGlowApple
{
public:
	CAppleWhite();		//デフォルトコンストラクタ
	CAppleWhite(CAppleTree* pTree);		//オーバーロードされたコンストラクタ
	virtual ~CAppleWhite();		//デストラクタ
	static CAppleWhite* Create(D3DXVECTOR3 pos, CAppleTree* pTree);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:
	CEffect* m_pEffectWind;	//風の渦のエフェクト

};

#endif // !_APPLE_WHITE_H_