//=============================================================================
//
// ポーズメニュー処理 [pauseMenu.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _PAUSE_MENU_H_
#define _PAUSE_MENU_H_

#include "selectMenu2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// ポーズメニュークラス
//*****************************************************************************
class CPauseMenu : public CSelectMenu2D
{
public:

	CPauseMenu();		//デフォルトコンストラクタ
	~CPauseMenu();		//デストラクタ
	static CPauseMenu* Create(void);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	virtual void Draw(void) {}	//描画処理

private:

};

#endif // !_PAUSE_MENU_H_