//=============================================================================
//
// シーン処理 [scene.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _SCENE_H_
#define _SCENE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;

//*****************************************************************************
// シーンクラス
//*****************************************************************************
class CScene
{
public:
	//シーンの種類
	enum class SCENE_TYPE {
		TITLE = 0,
		GAME,
		ENUM_MAX
	};

	CScene();	//デフォルトコンストラクタ
	virtual ~CScene();	//デストラクタ
	virtual void Init(void) = 0;	//初期化処理
	virtual void Uninit(void) = 0;	//終了処理
	virtual void Update(void) = 0;	//更新処理
	static void ChangeScene(CScene*& pScene, SCENE_TYPE typeScene);	//シーンの変更

	//プレイヤーのセッター・ゲッター
	void SetPlayer(CPlayer* pPlayer) { m_pPlayer = pPlayer; }
	CPlayer* GetPlayer(void) { return m_pPlayer; }
private:
	CPlayer* m_pPlayer;	//プレイヤーへのポインタ

};

#endif // !_SCENE_H_