//=============================================================================
//
// 苗木の処理 [seedling.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _SEEDLING_H_
#define _SEEDLING_H_

#include "objectModel.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
//前方宣言
//*****************************************************************************

//*****************************************************************************
// 苗木クラス
//*****************************************************************************
class CSeedling : public CObjectModel
{
public:
	CSeedling();	//デフォルトコンストラクタ
	~CSeedling();	//デストラクタ

	static CSeedling* Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot);	//生成処理
	HRESULT Init(void);		//初期化処理
	void Uninit(void);		//終了処理
	void Update(void);		//更新処理
	void Draw(void);		//描画処理

	void CreateScapegoat(void);	//生贄を生成

	void SetNumNeedEnemy(int nNum) { m_nNumNeedEnemy = nNum; }	//生贄を生成するために必要な、倒した敵の数の設定
	int GetNumNeedEnemy(void) { return m_nNumNeedEnemy; }	//生贄を生成するために必要な、倒した敵の数の取得

private:
	int m_nNumNeedEnemy;	//生贄を生成するために必要な、倒した敵の数

};

#endif // !_SEEDLING_H_