//=============================================================================
//
// 落雷処理 [thunder.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _THUNDER_H_
#define _THUNDER_H_

#include "main.h"
#include "effect.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObjectList;

//*****************************************************************************
// 落雷クラス
//*****************************************************************************
class CThunder : public CEffect
{
public:
	CThunder();	//デフォルトコンストラクタ
	virtual ~CThunder();	//デストラクタ
	static CThunder* Create(D3DXVECTOR3 pos);	//生成処理
	virtual HRESULT Init(void);	//初期化処理
	virtual void Uninit(void);	//終了処理
	virtual void Update(void);	//更新処理
	virtual void Draw(void);	//描画処理

private:
	void AttackCollision(int nObjtype);	//攻撃の当たり判定

	CObjectList* m_pListAttacked;	//攻撃済みのオブジェクトのリスト
};

#endif // !_THUNDER_H_